const params = new URLSearchParams(window.location.search);

const title = params.get("title");
const userId = Number(params.get("user"));
const eventIndex = Number(params.get("event"));

// 🔥 заголовок
if (title) {
    document.title = title;
    document.getElementById("title").textContent = title;
}

const users = JSON.parse(localStorage.getItem("users"));
if (!users) return;

const user = users.find(u => u.id === userId);
if (!user) return;

const eventData = user.events[eventIndex];

if (!eventData) return;

document.getElementById("text").textContent = eventData.title;
document.getElementById("image").src = eventData.img || "photo.jpg";

// pers.js
const teachers = [
    {
        teacherId: 1,
        events: [
            {
                id: 1,
                title: "Участь студентів у всеукраїнському міжуніверситетському хакатоні МХП",
              text: "Студенти 2–4 курсів спеціальності «Електропостачання» ВСП «ВФК МДУ» продемонстрували високий рівень професійної підготовки та креативного мислення, взявши участь у хакатоні, присвяченому вирішенню актуальних технічних проблем, які стосуються сучасної енергетики  та промисловості.Під час заходу учасники працювали над двома кейсами, які стосувалися реальних виробничих ситуацій:1. Проблема важкого пуску двигунів компресорних агрегатів на виробництві. Студенти аналізували причини надмірного навантаження на електромережу під час запуску потужних електродвигунів, розглядали можливі технічні рішення щодо пом’якшення пускових режимів, включаючи застосування струмообмежувальних реакторів та плавних пускових пристроїв.2. Забезпечення безперебійного енергопостачання в умовах відключення зовнішнього живлення. Особлива увага приділялася питанню балансування між генерацією та споживанням електричної енергії у внутрішній системі електропостачання підприємства, позаяк за умовами завдання деякі споживачі електроенергії не могли залишатись без електропостачання більше 20 хв. Учасники опрацьовували концепції автоматизованого керування навантаженнями, інтеграції резервних джерел живлення та оптимізації енергетичних потоків.Під час роботи над кейсами студенти отримували фахові консультації та підтримку викладачів спеціальних дисциплін Михайла ЛІСІЦКІ голови циклової комісії Євгенія ЧУТОРА та завідувач відділення Андрій ТОВТ, які спрямовували дослідницький пошук та допомагали структурувати технічні рішення.За активну участь у хакатоні всі студенти були відзначені сертифікатами а ВСП «ВФК МДУ» подякою, що підтверджують їх залучення до командної інженерної роботи над сучасними виробничими завданнями.",
                photos: ["hackathon/photo1.jpg", "hackathon/photo2.jpg", "hackathon/photo3.jpg"]
            },
            {
                id: 2,
                title: "Розвиток академічної мобільності",
              text: " 28 травня відбулася робоча зустріч представників двох провідних закладів фахової передвищої освіти, під час якої обговорювалися ключові аспекти впровадження внутрішньої академічної мобільності.У зустрічі взяли участь:<br> • Іваніга Йосип Йосипович — директор ВСП «Виноградівський фаховий коледж МДУ»;<br> • Рудь Ніна Андріївна — директор ВСП «Роменський фаховий коледж КНЕУ імені Вадима Гетьмана».<br>Також були присутні представники адміністрацій обох навчальних закладів. У межах перемовин сторони досягли домовленостей щодо укладення договору про співпрацю,який визначає чіткі механізми реалізації академічної мобільності між закладами. Особливу увагу було приділено формуванню сприятливих умов для тимчасового навчання студентів у партнерському коледжі, підвищенню кваліфікації викладачів, спільній розробці навчальних програм та обміну передовим педагогічним досвідом.  Серед основних напрямів співпраці:  • організація академічних обмінів студентів і викладачів; • створення спільних освітніх ініціатив та міжінституційних проєктів;• підтримка професійного розвитку через співпрацю, діалог і впровадження інноваційних підходів.Це партнерство — не лише формальний крок, а стратегічна ініціатива, що сприятиме формуванню відкритого освітнього простору, посиленню якості навчального процесу та розширенню можливостей для учасників освітнього середовища. Стежте за нашими новинами — попереду ще багато нових ініціатив, цікавих подій і прикладів ефективної співпраці в освіті!",
                photos: ["mobility/photo1.jpg", "mobility/photo2.jpg", "mobility/photo3.jpg"]
            }
        ]
    },





    {
        teacherId: 2,
        events: [
             {
                id: 1,
                title: "Участь студентів у всеукраїнському міжуніверситетському хакатоні МХП",
              text: "Студенти 2–4 курсів спеціальності «Електропостачання» ВСП «ВФК МДУ» продемонстрували високий рівень професійної підготовки та креативного мислення, взявши участь у хакатоні, присвяченому вирішенню актуальних технічних проблем, які стосуються сучасної енергетики  та промисловості.Під час заходу учасники працювали над двома кейсами, які стосувалися реальних виробничих ситуацій:1. Проблема важкого пуску двигунів компресорних агрегатів на виробництві. Студенти аналізували причини надмірного навантаження на електромережу під час запуску потужних електродвигунів, розглядали можливі технічні рішення щодо пом’якшення пускових режимів, включаючи застосування струмообмежувальних реакторів та плавних пускових пристроїв.2. Забезпечення безперебійного енергопостачання в умовах відключення зовнішнього живлення. Особлива увага приділялася питанню балансування між генерацією та споживанням електричної енергії у внутрішній системі електропостачання підприємства, позаяк за умовами завдання деякі споживачі електроенергії не могли залишатись без електропостачання більше 20 хв. Учасники опрацьовували концепції автоматизованого керування навантаженнями, інтеграції резервних джерел живлення та оптимізації енергетичних потоків.Під час роботи над кейсами студенти отримували фахові консультації та підтримку викладачів спеціальних дисциплін Михайла ЛІСІЦКІ голови циклової комісії Євгенія ЧУТОРА та завідувач відділення Андрій ТОВТ, які спрямовували дослідницький пошук та допомагали структурувати технічні рішення.За активну участь у хакатоні всі студенти були відзначені сертифікатами а ВСП «ВФК МДУ» подякою, що підтверджують їх залучення до командної інженерної роботи над сучасними виробничими завданнями.",
                photos: ["hackathon/photo1.jpg", "hackathon/photo2.jpg", "hackathon/photo3.jpg"]
            },
            {
                id: 2,
                title: "Розвиток академічної мобільності",
              text: " 28 травня відбулася робоча зустріч представників двох провідних закладів фахової передвищої освіти, під час якої обговорювалися ключові аспекти впровадження внутрішньої академічної мобільності.У зустрічі взяли участь:<br> • Іваніга Йосип Йосипович — директор ВСП «Виноградівський фаховий коледж МДУ»;<br> • Рудь Ніна Андріївна — директор ВСП «Роменський фаховий коледж КНЕУ імені Вадима Гетьмана».<br>Також були присутні представники адміністрацій обох навчальних закладів. У межах перемовин сторони досягли домовленостей щодо укладення договору про співпрацю,який визначає чіткі механізми реалізації академічної мобільності між закладами. Особливу увагу було приділено формуванню сприятливих умов для тимчасового навчання студентів у партнерському коледжі, підвищенню кваліфікації викладачів, спільній розробці навчальних програм та обміну передовим педагогічним досвідом.  Серед основних напрямів співпраці:  • організація академічних обмінів студентів і викладачів; • створення спільних освітніх ініціатив та міжінституційних проєктів;• підтримка професійного розвитку через співпрацю, діалог і впровадження інноваційних підходів.Це партнерство — не лише формальний крок, а стратегічна ініціатива, що сприятиме формуванню відкритого освітнього простору, посиленню якості навчального процесу та розширенню можливостей для учасників освітнього середовища. Стежте за нашими новинами — попереду ще багато нових ініціатив, цікавих подій і прикладів ефективної співпраці в освіті!",
                photos: ["mobility/photo1.jpg", "mobility/photo2.jpg", "mobility/photo3.jpg"]
            }
        ]
    },
            {
                id: 4,
                title: "Вступ до спеціальності",
               text: "06 листопада 2024 року у межах співпраці між ВСП «ВФК МДУ» та ПрАТ «Гроно-Текс» з дисципліни «Вступ до спеціальності» було проведено заняття-екскурсію на виробництві для студентів 1-го курсу спеціальності 174 Автоматизація, комп’ютерно-інтегровані технології та робототехніка. Супроводжували здобувачів освіти голова циклової комісії, викладач спеціальних дисциплін, Вікторія АНДРЕЄВА та викладач спеціальних дисциплін, Світлана АНДРЕЄВА.Перед початком екскурсії начальник відділу охорони праці, Богдан МІЗУН, провів студентам інструктаж з техніки безпеки.Заняття-екскурсію проводив заступник директора з питань технічного забезпечення – Василь БІРОВ.Студенти ознайомились з структурою підприємства, його основними цехами та обладнанням, яке використовується на різних ділянках підприємства. Вони побачили в роботі весь процес виготовлення виробу: розкрій, пошив, волого-теплову обробку та доставку виробів на склад готової продукції. Крім того, студентів ознайомили з технологічним процесом подачі пари в цехи за допомогою компресорної станції та як виконується подача енергоживлення, якщо нема основного джерела – за допомогою сонячних панелей та резервних генераторів.Особливу зацікавленість у студентів викликали автоматизовані установки розкрою тканини, пошиву виробу, пароманекени та преси.Здобувачі освіти побачили одну з багатьох можливостей реалізації себе як фахівців-електромеханіків.Навчальний заклад та студенти вдячні ПрАТ «Гроно-Текс» за можливість побувати на цікавому занятті, завданням якого було підвищення мотивації до навчання та формування професійних компетентностей у здобувачів освіти.",
                photos: [
                    "intro/photo1.jpg", "intro/photo2.jpg", "intro/photo3.jpg",
                    "intro/photo4.jpg", "intro/photo5.jpg", "intro/photo6.jpg",
                    "intro/photo7.jpg", "intro/photo8.jpg", "intro/photo9.jpg",
                    "intro/photo10.jpg"
                ]
            },
             {
                id: 5,
                title: "Гостьова лекція для студентів спеціальності 151",
                text: "29 листопада 2024 року відбулась гостьова лекція від Тернопільського національного університету імені Івана Пулюя для студентів спеціальності 151 Автоматизація та комп’ютерно-інтегровані технології з дисципліни «Теорія автоматичного керування та автоматичні регулятори».Заняття на тему: «Математичний опис систем автоматичного керування та частотні функції елементів» проводив Ігор КОЗУБ – заступник завідувача кафедри автоматизації технологічних процесів та виробництв. На лекції, крім студентів, були також присутні викладачі спеціальних дисциплін циклової комісії спеціальності 174 Автоматизація, комп’ютерно-інтегровані технології та робототехніка: Вікторія АНДРЕЄВА, Світлана АНДРЕЄВА, Йосип ІВАНІГА та Едуард ГЕРА. Також на лекції була присутня Оксана КЛЮВАК – заступник директора з навчальної роботи.<br> Заняття було проведено у формі практичної роботи з автоматизації математичного моделювання параметрів регулювання автоматизованої системи; використання можливостей програми для кожного типу типових ланок, що застосовуються в перехідних процесах, з можливістю зміни параметрів процесу; моделювання передавальних функцій, частотних та логарифмічно-частотних характеристик. Ці роботи було виконано та візуалізовано для студентів за допомогою програми PTC Mathcad Prime 10.<br> Студенти цікавились практичним використанням програм САПР при розрахунку параметрів електронних установок та для професійній діяльності в майбутньому.<br> Відокремлений структурний підрозділ «Виноградівський фаховий коледж Мукачівського державного університету» вдячний Тернопільському національному університету імені Івана Пулюя за співпрацю.",
                photos: [
                    "intro/photo1.jpg", "intro/photo2.jpg", "intro/photo3.jpg",
                    "intro/photo4.jpg", "intro/photo5.jpg", "intro/photo6.jpg",
                    "intro/photo7.jpg", "intro/photo8.jpg", "intro/photo9.jpg",
                    "intro/photo10.jpg"
                ]
            },
             {
                id: 6,
                title: "Методичний семінар “Вплив ергономічних факторів на сприйняття інформації в закладах освіти”",
                text: "24 березня 2025 року в рамках тижня спеціальності 174 Автоматизація, комп’ютерно-інтегровані технології та робототехніка у Відокремленому структурному підрозділі «Виноградівський фаховий коледж Мукачівського державного університету» відбувся семінар для викладачів на тему “Вплив ергономічних факторів на сприйняття інформації в закладах освіти”. Захід відкрила голова циклової комісії Вікторія Андреєва, а доповідачем виступила спеціаліст вищої категорії, викладач-методист Світлана Андреєва.<br>Головною метою семінару було узагальнення досвіду застосування ергономічних технологій у викладанні дисциплін різної складності. Було розглянуто практики використання ергономіки у виробництві, побуті, охороні праці, безпеці життєдіяльності та цивільному захисті.<br>Одним із ключових аспектів семінару стало обговорення ефективного використання кольору для покращення сприйняття навчальної інформації. Колір допомагає акцентувати увагу на важливих деталях та взаємозв’язках, що особливо актуально для технічних дисциплін.<br>Методика кольорового виділення показала високу ефективність у полегшенні сприйняття складної технічної інформації. Викладачі звернули увагу, що студенти з часом автоматично ідентифікують необхідні елементи схем навіть у чорно-білому вигляді.<br>Учасники семінару, серед яких були викладачі Ярослава Теремта та Йосип Іваніга, підкреслили актуальність використання ергономічних методів для покращення засвоєння навчального матеріалу. Заступник директора з навчальної роботи Оксана Клювак запропонувала включити до програм деяких технічних дисципліни розділ “Ергономіка у виробництві”.<br>Під час обговорення було наголошено, що ергономічні принципи вже давно застосовуються в освіті, проте лише нещодавно вони були узагальнені в окрему науку “Ергономіка”, яка активно використовується в усьому світі.<br>Семінар продемонстрував важливість впровадження ергономічних підходів у навчальний процес. Використання кольорового кодування та інших ергономічних методик дозволяє не лише покращити сприйняття інформації, а й забезпечити ефективну підготовку студентів до роботи у виробничих умовах.",
                photos: [
                    "intro/photo1.jpg", "intro/photo2.jpg", "intro/photo3.jpg",
                    "intro/photo4.jpg", "intro/photo5.jpg", "intro/photo6.jpg",
                    "intro/photo7.jpg", "intro/photo8.jpg", "intro/photo9.jpg",
                    "intro/photo10.jpg"
                ]
            },
 {
                id: 7,
                title: "Заняття-екскурсія з дисципліни «Вступ до спеціальності»",
                text: "06 листопада 2024 року у межах співпраці між Відокремленим структурним підрозділом «Виноградівський фаховий коледж Мукачівського державного університету» та ПрАТ «Гроно-Текс» з дисципліни «Вступ до спеціальності» було проведено заняття-екскурсію на виробництві для студентів 1-го курсу спеціальності 174 Автоматизація, комп’ютерно-інтегровані технології та робототехніка. Супроводжували здобувачів освіти голова циклової комісії, викладач спеціальних дисциплін, Вікторія АНДРЕЄВА та викладач спеціальних дисциплін, Світлана АНДРЕЄВА.Перед початком екскурсії начальник відділу охорони праці, Богдан МІЗУН, провів студентам інструктаж з техніки безпеки.<br>Заняття-екскурсію проводив заступник директора з питань технічного забезпечення – Василь БІРОВ.<br>Студенти ознайомились з структурою підприємства, його основними цехами та обладнанням, яке використовується на різних ділянках підприємства. Вони побачили в роботі весь процес виготовлення виробу: розкрій, пошив, волого-теплову обробку та доставку виробів на склад готової продукції. Крім того, студентів ознайомили з технологічним процесом подачі пари в цехи за допомогою компресорної станції та як виконується подача енергоживлення, якщо нема основного джерела – за допомогою сонячних панелей та резервних генераторів.<br>Особливу зацікавленість у студентів викликали автоматизовані установки розкрою тканини, пошиву виробу, пароманекени та преси.<br>Здобувачі освіти побачили одну з багатьох можливостей реалізації себе як фахівців-електромеханіків.<br>Навчальний заклад та студенти вдячні ПрАТ «Гроно-Текс» за можливість побувати на цікавому занятті, завданням якого було підвищення мотивації до навчання та формування професійних компетентностей у здобувачів освіти.",
                photos: [
                    "intro/photo1.jpg", "intro/photo2.jpg", "intro/photo3.jpg",
                    "intro/photo4.jpg", "intro/photo5.jpg", "intro/photo6.jpg",
                    "intro/photo7.jpg", "intro/photo8.jpg", "intro/photo9.jpg",
                    "intro/photo10.jpg"
                ]
            },
    {
  id: 7,
                title: "Інтегроване заняття на ПрАТ «Гроно-Текс»",
                text: "10 листопада 2025 року здобувачі освіти I курсу спеціальності G7 Автоматизація, комп’ютерно-інтегровані технології та робототехніка разом зі студентами III курсу спеціальності 242 Туризм і рекреація відвідали підприємство ПрАТ «Гроно-Текс».<br>Захід відбувся у форматі заняття-екскурсії з дисципліни «Вступ до спеціальності», метою якого було ознайомлення студентів із виробничими процесами, структурою фабрики та сучасними технологіями автоматизації, що впроваджуються на підприємстві.<br>Студентів супроводжували голова циклової комісії, викладач спеціальних дисциплін Андреєва Вікторія та куратор і викладач Кикирчинь Вікторія. Заняття проводив Василь Біров — головний механік ПрАТ «Гроно-Текс».<br>Майбутні фахівці з автоматизації дослідили роботу цехів, де використовується комп’ютеризоване та автоматизоване обладнання. Вони також ознайомилися з енергетичною системою підприємства, що включає, крім основного живлення, ще й сонячні панелі та генератори. Студенти відвідали компресорну, акумуляторну та котельню, де побачили роботу енергообладнання в реальних умовах.<br>Для студентів спеціальності 242 Туризм і рекреація  екскурсія мала іншу, не менш важливу мету — ознайомлення з промисловою та економічною інфраструктурою рідного краю, формування уявлення про туристичний потенціал місцевих підприємств як елементів індустріального та пізнавального туризму.<br>Таким чином, відвідування фабрики стало міждисциплінарним заходом, який поєднав технічну, економічну й культурно-пізнавальну складові, сприяючи розширенню професійного кругозору студентів обох спеціальностей.",
                photos: [
                    "intro/photo1.jpg", "intro/photo2.jpg", "intro/photo3.jpg",
                    "intro/photo4.jpg", "intro/photo5.jpg", "intro/photo6.jpg",
                    "intro/photo7.jpg", "intro/photo8.jpg", "intro/photo9.jpg",
                    "intro/photo10.jpg"
                ]
            },
 {
  id: 8,
                title: "Студентська науково-практична конференція",
                text: "25 березня 2025 року в рамках тижня спеціальності Автоматизація, комп’ютерно-інтегровані технології та робототехніка відбулася студентська науково-практична конференція “Інновації навколо нас”.<br>Захід урочисто відкрила голова циклової комісії Вікторія АНДРЕЄВА, привітавши всіх учасників та наголосивши на важливості впровадження інновацій у сучасний світ.<br>Ця подія стала чудовою можливістю для молодих дослідників, студентів та викладачів обговорити найсучасніші технологічні тенденції, що вже сьогодні змінюють наше життя. Учасники представили свої інноваційні проєкти, дослідження та аналіз новітніх технологій, які формують майбутнє.<br>У конференції взяли участь студенти 1–3 курсів спеціальності 174 Автоматизація, комп’ютерно-інтегровані технології та робототехніка, а також студентка 2-го курсу спеціальності Ресторанне обслуговування, яка розглянула інновації у сфері гастрономії.<br>У ході конференції учасники розглянули найактуальніші інновації, які охоплюють різні сфери науки та техніки:<br>3D-друк у харчовій промисловості: чи може ця технологія зробити продукти харчування доступнішими та кориснішими?<br>Доповідачі:<br>Онисько Юліана, студентка 2-го курсу, спеціальність Ресторанне обслуговування.<br>Співак Дмитро, студент 2-го курсу, спеціальність 174 Автоматизація, комп’ютерно-інтегровані технології та робототехніка, група МО-21.<br>Зелена енергетика та екологічні інновації: які технології допоможуть зробити планету чистішою та зменшити негативний вплив на навколишнє середовище?<br>Доповідач: Височанська Аліна, студентка 1-го курсу, група МО-11.<br>Розумні будинки та автоматизація побуту: як технології IoT (Інтернет речей) змінюють комфорт і безпеку нашого житла?<br>Доповідач: Іскович Анастасія, студентка 2-го курсу, група МО-21.<br>Штучний інтелект у творчості: як нейромережі впливають на креативні професії?<br>Доповідач: Густі Віталій, студент 3-го курсу, група МО-31.<br>Штучний інтелект у виробництві: чи може AI замінити людину?<br>Доповідач: Росоха Максим, студент 2-го курсу, група МО-21.<br>Дрони та автономні транспортні системи: як вони інтегруються у наше повсякденне життя та промисловість?<br>Доповідач: Тупиця Арсеній, студент 3-го курсу, група МО-31.<br>Віртуальна та доповнена реальність – це не лише розваги, а й новий рівень взаємодії з цифровим світом. Як ці технології впливають на освіту, медицину та бізнес?<br>Доповідач: Буднік Богдан, студент 3-го курсу, група МО-31.<br>Сучасний світ стрімко розвивається, і технології, які ми обговорюємо сьогодні, завтра стануть частиною нашого повсякденного життя. Конференція “Інновації навколо нас” – це не лише обмін знаннями, а й шанс побачити перспективи професійного розвитку, знайти однодумців та натхнення для створення власних проєктів.<br>Учасники конференції продемонстрували високий рівень підготовки, креативний підхід та здатність генерувати нові ідеї. Дискусії були насиченими, доповіді – інформативними, а інноваційні рішення викликали жваве обговорення серед гостей.<br>Захід завершив директор фахового коледжу Йосип ІВАНІГА, який подякував студентам та викладачам за активну участь та наголосив, що подібні конференції гарна традиція, яку циклова комісія продовжує з року в рік.<br>Конференція пройшла у динамічній і творчій атмосфері, залишивши по собі багато яскравих вражень та мотивацію до подальших наукових досліджень!<br>Майбутнє починається вже сьогодні! Долучайтеся до світу інновацій разом із нами!",
                photos: [
                    "intro/photo1.jpg", "intro/photo2.jpg", "intro/photo3.jpg",
                    "intro/photo4.jpg", "intro/photo5.jpg", "intro/photo6.jpg",
                    "intro/photo7.jpg", "intro/photo8.jpg", "intro/photo9.jpg",
                    "intro/photo10.jpg"
                ]
            },








   {
        teacherId: 3,
        events: [
            {
                id: 3,
               title: "Актуальні технічні рішення та професійні компетентності: захист курсових проєктів",
    text: "На початку грудня 2025 року у ВСП «ВФК МДУ» відбувся захист курсових проєктів студентів 4-го курсу спеціальності 151 «Автоматизація та комп’ютерно-інтегровані технології» з дисципліни «Монтаж, експлуатація та налагодження технічних засобів автоматизованих систем». До складу комісії увійшли: Вікторія ЧОНКА — завідувач відділення; Вікторія АНДРЕЄВА — викладач спеціальних дисциплін, керівник курсових проєктів; Едуард ГЕРА — викладач спеціальних дисциплін. Під час захисту студенти продемонстрували вміння застосовувати теоретичні знання у практичних умовах, представили технічно обґрунтовані рішення з модернізації, монтажу та налагодження обладнання автоматизованих систем. Особлива увага була приділена актуальності обраних тем, їхньому практичному значенню та відповідності сучасним потребам виробництва. Проєкти відзначалися реалістичністю технічних рішень, орієнтацією на підвищення ефективності технологічних процесів, енергозбереження, безпеку експлуатації та впровадження елементів автоматизованого керування. Комісія підкреслила, що такі напрацювання є затребуваними на сучасних підприємствах, де зростає потреба у фахівцях, здатних комплексно працювати з технічними засобами АСУ. На завершення члени комісії побажали студентам подальших професійних успіхів, творчої наснаги, впевненості у власних силах та реалізації себе у галузі автоматизації. Отримані під час роботи над курсовими проєктами компетентності стануть важливою основою їхньої майбутньої професійної діяльності.",
                photos: [
                    "projects/photo1.jpg", "projects/photo2.jpg", "projects/photo3.jpg",
                    "projects/photo4.jpg", "projects/photo5.jpg", "projects/photo6.jpg",
                    "projects/photo7.jpg", "projects/photo8.jpg", "projects/photo9.jpg",
                    "projects/photo10.jpg"
                ]
            }
        ]
    },



     {
        teacherId: 4,
        events: [
            {
                id: 3,
               title: "Актуальні технічні рішення та професійні компетентності: захист курсових проєктів",
    text: "На початку грудня 2025 року у ВСП «ВФК МДУ» відбувся захист курсових проєктів студентів 4-го курсу спеціальності 151 «Автоматизація та комп’ютерно-інтегровані технології» з дисципліни «Монтаж, експлуатація та налагодження технічних засобів автоматизованих систем». До складу комісії увійшли: Вікторія ЧОНКА — завідувач відділення; Вікторія АНДРЕЄВА — викладач спеціальних дисциплін, керівник курсових проєктів; Едуард ГЕРА — викладач спеціальних дисциплін. Під час захисту студенти продемонстрували вміння застосовувати теоретичні знання у практичних умовах, представили технічно обґрунтовані рішення з модернізації, монтажу та налагодження обладнання автоматизованих систем. Особлива увага була приділена актуальності обраних тем, їхньому практичному значенню та відповідності сучасним потребам виробництва. Проєкти відзначалися реалістичністю технічних рішень, орієнтацією на підвищення ефективності технологічних процесів, енергозбереження, безпеку експлуатації та впровадження елементів автоматизованого керування. Комісія підкреслила, що такі напрацювання є затребуваними на сучасних підприємствах, де зростає потреба у фахівцях, здатних комплексно працювати з технічними засобами АСУ. На завершення члени комісії побажали студентам подальших професійних успіхів, творчої наснаги, впевненості у власних силах та реалізації себе у галузі автоматизації. Отримані під час роботи над курсовими проєктами компетентності стануть важливою основою їхньої майбутньої професійної діяльності.",
                photos: [
                    "projects/photo1.jpg", "projects/photo2.jpg", "projects/photo3.jpg",
                    "projects/photo4.jpg", "projects/photo5.jpg", "projects/photo6.jpg",
                    "projects/photo7.jpg", "projects/photo8.jpg", "projects/photo9.jpg",
                    "projects/photo10.jpg"
                ]
            }
        ]
    },







     {
        teacherId: 5,
        events: [
             {
                id: 1,
                title: "Участь студентів у всеукраїнському міжуніверситетському хакатоні МХП",
              text: "Студенти 2–4 курсів спеціальності «Електропостачання» ВСП «ВФК МДУ» продемонстрували високий рівень професійної підготовки та креативного мислення, взявши участь у хакатоні, присвяченому вирішенню актуальних технічних проблем, які стосуються сучасної енергетики  та промисловості.Під час заходу учасники працювали над двома кейсами, які стосувалися реальних виробничих ситуацій:1. Проблема важкого пуску двигунів компресорних агрегатів на виробництві. Студенти аналізували причини надмірного навантаження на електромережу під час запуску потужних електродвигунів, розглядали можливі технічні рішення щодо пом’якшення пускових режимів, включаючи застосування струмообмежувальних реакторів та плавних пускових пристроїв.2. Забезпечення безперебійного енергопостачання в умовах відключення зовнішнього живлення. Особлива увага приділялася питанню балансування між генерацією та споживанням електричної енергії у внутрішній системі електропостачання підприємства, позаяк за умовами завдання деякі споживачі електроенергії не могли залишатись без електропостачання більше 20 хв. Учасники опрацьовували концепції автоматизованого керування навантаженнями, інтеграції резервних джерел живлення та оптимізації енергетичних потоків.Під час роботи над кейсами студенти отримували фахові консультації та підтримку викладачів спеціальних дисциплін Михайла ЛІСІЦКІ голови циклової комісії Євгенія ЧУТОРА та завідувач відділення Андрій ТОВТ, які спрямовували дослідницький пошук та допомагали структурувати технічні рішення.За активну участь у хакатоні всі студенти були відзначені сертифікатами а ВСП «ВФК МДУ» подякою, що підтверджують їх залучення до командної інженерної роботи над сучасними виробничими завданнями.",
                photos: ["hackathon/photo1.jpg", "hackathon/photo2.jpg", "hackathon/photo3.jpg"]
            },
            {
                id: 2,
                title: "Розвиток академічної мобільності",
              text: " 28 травня відбулася робоча зустріч представників двох провідних закладів фахової передвищої освіти, під час якої обговорювалися ключові аспекти впровадження внутрішньої академічної мобільності.У зустрічі взяли участь:<br> • Іваніга Йосип Йосипович — директор ВСП «Виноградівський фаховий коледж МДУ»;<br> • Рудь Ніна Андріївна — директор ВСП «Роменський фаховий коледж КНЕУ імені Вадима Гетьмана».<br>Також були присутні представники адміністрацій обох навчальних закладів. У межах перемовин сторони досягли домовленостей щодо укладення договору про співпрацю,який визначає чіткі механізми реалізації академічної мобільності між закладами. Особливу увагу було приділено формуванню сприятливих умов для тимчасового навчання студентів у партнерському коледжі, підвищенню кваліфікації викладачів, спільній розробці навчальних програм та обміну передовим педагогічним досвідом.  Серед основних напрямів співпраці:  • організація академічних обмінів студентів і викладачів; • створення спільних освітніх ініціатив та міжінституційних проєктів;• підтримка професійного розвитку через співпрацю, діалог і впровадження інноваційних підходів.Це партнерство — не лише формальний крок, а стратегічна ініціатива, що сприятиме формуванню відкритого освітнього простору, посиленню якості навчального процесу та розширенню можливостей для учасників освітнього середовища. Стежте за нашими новинами — попереду ще багато нових ініціатив, цікавих подій і прикладів ефективної співпраці в освіті!",
                photos: ["mobility/photo1.jpg", "mobility/photo2.jpg", "mobility/photo3.jpg"]
            }
        ]
            {
                id: ,
                title: "Актуальні технічні рішення та професійні компетентності: захист курсових проєктів",
                text: `На початку грудня 2025 року відбувся захист курсових проєктів студентів 4-го курсу спеціальності 151 «Автоматизація та комп’ютерно-інтегровані технології»...
                Під час захисту студенти продемонстрували вміння застосовувати теоретичні знання у практичних умовах...`,
                photos: [
                    "projects/photo1.jpg", "projects/photo2.jpg", "projects/photo3.jpg",
                    "projects/photo4.jpg", "projects/photo5.jpg", "projects/photo6.jpg",
                    "projects/photo7.jpg", "projects/photo8.jpg", "projects/photo9.jpg",
                    "projects/photo10.jpg"
                ]
            }
        ]
    },
];

export default teachers;
